Revit 2026 API

# SolidGlassSolidglassReflectance Property

---

The property labeled "Reflectance" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SolidglassReflectance { get; }
```
```vb
Public Shared ReadOnly Property SolidglassReflectance As String
	Get
```
```cpp
public:
static property String^ SolidglassReflectance {
	String^ get ();
}
```
```fsharp
static member SolidglassReflectance : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace